---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNaming
source: html/9cbd5979-5bcc-17b7-8ae2-592bf944216f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNaming Property

"Circuit Naming"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecCircuitNaming { get; }
```